ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
/**
 * @file stm32fx0xPeripherals.cpp
 *
 * @date 05.12.2012
 * @author Armin Joachimsmeyer
 * armin.joachimsmeyer@gmail.com
 * @copyright LGPL v3 (http://www.gnu.org/licenses/lgpl.html)
 * @version 1.5.0
 */

#include "stm32fx0xPeripherals.h"
#include "BlueDisplay.h" // for WWDG_IRQHandler

#include "timing.h"
#include "pitches.h" // for playEndTone

#include <stdio.h>
/** @addtogroup Peripherals_Library
 * @{
 */

/**
 *  Calibrating with value from SystemMemory:
 *
 * ActualRefVoltageADC (normally VDDA) = ((CalValueForRefint * 3.3V) / ActualReadingRefint)
 *
 * 3V (gives better resolution than 1V)         Reading 3V                         3.0V * 4096 * ActualReadingRefint
 *  ----------------------------------  = --------------------- => Reading 3V = -------------------------------------
 *       ActualRefVoltageADC                Reading VRef (4096)                    CalValueForRefint * 3.3V
 *
 *  Formula for ScaleFactor (3V for 240 Pixel) is:
 *    Reading 3V * ScaleFactor = 240 (DISPLAY_HEIGHT)
 *
 *                       240  * 3.3V * CalValueForRefint
 *  => ADCScaleFactor = ---------------------------------
 *                       4096 * 3.0V * ActualReadingRefint
 *
 *                    CalValueForRefint
 *   = 0,064453125 * -------------------
 *                    ActualReadingRefint
 *
 *   0,064453125 * 2^18(=262144) = 16896.0
 *
 */

float sADCToVoltFactor; // Factor for ADC Reading -> Volt = sADCRefVoltage / 4096
uint16_t sReading3Volt; // Raw value for 3V input
uint16_t sRefintActualReading; // actual conversion value of VREFINT / see VREFINT_CAL or *((uint16_t*) 0x1FFFF7BA) = value of VREFINT at 3.3V
unsigned int sADCScaleFactorShift18; // Factor for ADC Reading -> Display for 0,5 Volt/div(=40pixel) scale - shift 18 because we have 12 bit ADC and 12 + 18 + sign + buffer = 32 bit register
float sVDDA;
uint16_t sTempValueAtZeroDegreeShift3 = 0;

#ifdef HAL_DAC_MODULE_ENABLED
DAC_HandleTypeDef DAC1Handle;
#endif
ADC_HandleTypeDef ADC1Handle;
static bool isADCInitializedForTimerEvents;

ADC_HandleTypeDef ADC2Handle;
DMA_HandleTypeDef DMA11_ADC1_Handle;
TIM_HandleTypeDef TIM15Handle;
TIM_HandleTypeDef TIMSynthHandle;
TIM_HandleTypeDef TIMToneHandle;
TIM_HandleTypeDef TIM_DSOHandle;
TIM_HandleTypeDef TIM7Handle;
RTC_HandleTypeDef RTCHandle;
extern SPI_HandleTypeDef SpiHandle; // from stm32f3_discovery.c line 98 - must remove static there
SPI_HandleTypeDef * SPI1HandlePtr = &SpiHandle;
#ifdef HAL_WWDG_MODULE_ENABLED
WWDG_HandleTypeDef WWDGHandle;
#endif
ADC_ChannelConfTypeDef ADCChannelConfigDefault; // pre filled structure for ADC channels - ADC_REGULAR_RANK_1, ADC_SINGLE_ENDED, ADC_OFFSET_NONE
TIM_OC_InitTypeDef TIMOCInitDefault;

/**
 * ADC must be ready and continuous mode disabled
 * read ref channel and use Value from Address 0x1FFFF7BA
 * USE ADC 1
 */
#define VREFINT_CAL       ((uint16_t*) ((uint32_t)0x1FFFF7BA))  /* Internal temperature sensor, parameter VREFINT_CAL: Raw data acquired at a temperature of 30 DegC (+-5 DegC), VDDA = 3.3 V (+-10 mV) */

void ADC_setRawToVoltFactor(void) {

    if (isADCInitializedForTimerEvents) {
#ifdef STM32F30X
        MODIFY_REG(ADC1Handle.Instance->CFGR, ADC_CFGR_EXTSEL|ADC_CFGR_EXTEN, ADC_SOFTWARE_START | ADC_EXTERNALTRIGCONVEDGE_NONE);
#else
        MODIFY_REG(ADC1Handle.Instance->CR2, ADC_CR2_EXTSEL, ADC_SOFTWARE_START);
#endif
    }

    // Set one channel for rank1
#ifdef STM32F30X
    ADC1Handle.Instance->SQR1 = __HAL_ADC_SQR1_RK(ADC_CHANNEL_VREFINT, 1);
    // get VREFINT_CAL (value of reading calibration input acquired at temperature of 30 °C and VDDA=3.3 V) - see chapter 3.12.2 of datasheet
    uint16_t tREFCalibrationValue = *VREFINT_CAL;
#else
    ADC1Handle.Instance->SQR3 = ADC_CHANNEL_VREFINT;
    // assume 1.2 Volt
    uint16_t tREFCalibrationValue = (1.2 * 4095) / 3.3;// = 1489
#endif

    bool tTimeout = false;
    setTimeoutMillis(10);
    uint32_t tRefActualReadingTimes8 = 0;

    for (int i = 0; i < 8; ++i) {
        // Do not use HAL_ADC_Start() is "enables" ADC first and calls MSP_init
#ifdef STM32F30X
        SET_BIT(ADC1Handle.Instance->CR, ADC_CR_ADSTART);
#else
        // could use external software trigger and (ADC_CR2_SWSTART | ADC_CR2_EXTTRIG) instead
        SET_BIT(ADC1Handle.Instance->CR2, ADC_CR2_ADON);
#endif

        /* Test EOC flag */
        while (__HAL_ADC_GET_FLAG(&ADC1Handle, ADC_FLAG_EOC) == RESET) {
#ifdef STM32F30X
            if (isTimeout(ADC1Handle.Instance->ISR)) {
#else
                if (isTimeout(ADC1Handle.Instance->SR)) {
#endif
                tTimeout = true;
                break;
            }
        }
        // TODO check word access
        tRefActualReadingTimes8 += ADC1Handle.Instance->DR & 0xFFFF; // & 0xFFFF since on 32F1xx the upper word contains ADC2->DR value
    }

    if (tTimeout) {
        sRefintActualReading = tREFCalibrationValue;
    } else {
        sRefintActualReading = tRefActualReadingTimes8 / 8;
    }
    // use stored calibration value from system area - 0,064453125 * 2^21 = 135168
    sVDDA = 3.3 * tREFCalibrationValue / sRefintActualReading;
    sADCScaleFactorShift18 = tREFCalibrationValue * 135168 / tRefActualReadingTimes8;
    sReading3Volt = (3.0 * tRefActualReadingTimes8 * (4096 / 8)) / (3.3 * tREFCalibrationValue);
    sADCToVoltFactor = 3.3 * tREFCalibrationValue / (tRefActualReadingTimes8 * (4096 / 8));
    //    // restore ADC configuration for timer events
    if (isADCInitializedForTimerEvents) {
#ifdef STM32F30X
        MODIFY_REG(ADC1Handle.Instance->CFGR, ADC_CFGR_EXTSEL|ADC_CFGR_EXTEN,
                ADC1_EXTERNALTRIGCONV | ADC_EXTERNALTRIGCONVEDGE_RISING);
#else
        MODIFY_REG(ADC1Handle.Instance->CR2, ADC_CR2_EXTSEL, ADC1_EXTERNALTRIGCONV);
#endif
    }
}

// TODO replace HAL_ADC_ConfigChannel (448 bytes code size)
void MY_ADC_ConfigChannel(ADC_HandleTypeDef* hadc, ADC_ChannelConfTypeDef* sConfig) {

