ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
}

/**
 * ADC2 for AccuCapacity
 */
#define ADC2_PERIPH_CLOCK                       RCC_AHBPeriph_ADC12

// Two input pins
#define ADC2_INPUT1_CHANNEL                     ADC_Channel_6
#define ADC2_INPUT1_PIN                         GPIO_PIN_0
#define ADC2_INPUT1_PORT                        GPIOC

#define ADC2_INPUT2_CHANNEL                     ADC_Channel_7
#define ADC2_INPUT2_PIN                         GPIO_PIN_1
#define ADC2_INPUT2_PORT                        GPIOC

void HAL_ADC_MspInit(ADC_HandleTypeDef* aADCHandle) {
    GPIO_InitTypeDef GPIO_InitStructure;

    // use slow clock
#ifdef STM32F30X
    __HAL_RCC_ADC12_CONFIG(RCC_ADC12PLLCLK_DIV64); // 1,125 MHz
#else
            __HAL_RCC_ADC_CONFIG(RCC_ADCPCLK2_DIV8); // 9 MHz
#endif
    if (aADCHandle == &ADC1Handle) {
        __ADC1_CLK_ENABLE()
        ;
        /**
         * ADC GPIO input pin init
         */
        __GPIOA_CLK_ENABLE()
        ;
        // Configure pin A0 + A1 + A2 (+ A3) as analog input
        GPIO_InitStructure.Pin = DSO_INPUT_PINS;
        GPIO_InitStructure.Mode = GPIO_MODE_ANALOG;
        GPIO_InitStructure.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(DSO_INPUT_PORT, &GPIO_InitStructure);

        // almost highest priority for ADC
        NVIC_SetPriority((IRQn_Type) (ADC1_2_IRQn), 1);
        HAL_NVIC_EnableIRQ((IRQn_Type) (ADC1_2_IRQn));

        ADC1_DMA_initialize();
    } else {
        __ADC2_CLK_ENABLE()
        ;
        /**
         * ADC GPIO input pin init
         */
        __GPIOC_CLK_ENABLE()
        ;
        /* Configure pin as analog input */
        GPIO_InitStructure.Pin = ADC2_INPUT1_PIN | ADC2_INPUT2_PIN;
        GPIO_InitStructure.Mode = GPIO_MODE_ANALOG;
        GPIO_InitStructure.Pull = GPIO_NOPULL;
        HAL_GPIO_Init(ADC2_INPUT1_PORT, &GPIO_InitStructure);
    }
}

void ADC2_init(void) {
    ADC2Handle.Instance = ADC2;

    /*
     * configure ADC
     */
    ADC2Handle.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    ADC2Handle.Init.ScanConvMode = ADC_SCAN_DISABLE;
    ADC2Handle.Init.ContinuousConvMode = DISABLE; // one conversion after trigger
    ADC2Handle.Init.NbrOfConversion = 1;
    ADC2Handle.Init.DiscontinuousConvMode = DISABLE;
    ADC2Handle.Init.NbrOfDiscConversion = 1;
    ADC2Handle.Init.ExternalTrigConv = ADC_SOFTWARE_START;
#ifdef STM32F30X
    ADC2Handle.Init.ClockPrescaler = ADC_CLOCK_ASYNC; // uses ADC_12CK Clock source
    ADC2Handle.Init.Resolution = ADC_RESOLUTION12b;
    ADC2Handle.Init.EOCSelection = EOC_SINGLE_CONV;
    ADC2Handle.Init.LowPowerAutoWait = DISABLE;
    ADC2Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    ADC2Handle.Init.DMAContinuousRequests = DISABLE;
    ADC2Handle.Init.Overrun = OVR_DATA_OVERWRITTEN;
#endif
    /*
     * Starts also the voltage regulator and calls HAL_ADC_MspInit()
     */
    HAL_ADC_Init(&ADC2Handle);

// Calibration
#ifdef STM32F30X
    HAL_ADCEx_Calibration_Start(&ADC2Handle, ADC_SINGLE_ENDED);
#else
    HAL_ADCEx_Calibration_Start(&ADC2Handle);
#endif

// Enable ADC
    ADC_enableAndWait(&ADC2Handle);
}

void ADC12_init(void) {
    /*
     * pre fill default channel structure
     */
    ADCChannelConfigDefault.Rank = ADC_REGULAR_RANK_1;
#ifdef STM32F30X
    ADCChannelConfigDefault.SingleDiff = ADC_SINGLE_ENDED;
    ADCChannelConfigDefault.OffsetNumber = ADC_OFFSET_NONE;
    ADCChannelConfigDefault.Offset = 0;
#endif
    int tErrorCode;

    __ADC1_CLK_ENABLE()
    ;
    __ADC2_CLK_ENABLE()
    ;
    /*
     * Configure and enable special channels / set sample time
     */
    ADC1Handle.Instance = ADC1;
// TEMP + VBAT channel need 2.2 micro sec. sampling so ADC_SAMPLETIME_61CYCLES_5 should be enough;
    ADCChannelConfigDefault.Channel = ADC_CHANNEL_TEMPSENSOR;
    ADCChannelConfigDefault.SamplingTime = ADC_SAMPLETIME_SENSOR;
// Mainly - set sampling time
    tErrorCode = HAL_ADC_ConfigChannel(&ADC1Handle, &ADCChannelConfigDefault);

// REFINT is also available on ADC2
    ADCChannelConfigDefault.Channel = ADC_CHANNEL_VREFINT;
    ADCChannelConfigDefault.SamplingTime = ADC_SAMPLETIME_SENSOR;
    tErrorCode |= HAL_ADC_ConfigChannel(&ADC1Handle, &ADCChannelConfigDefault);

#ifdef STM32F30X
    ADCChannelConfigDefault.Channel = ADC_CHANNEL_VBAT;
    ADCChannelConfigDefault.SamplingTime = ADC_SAMPLETIME_SENSOR;
    tErrorCode |= HAL_ADC_ConfigChannel(&ADC1Handle, &ADCChannelConfigDefault);
#endif
    assert_param(tErrorCode == HAL_OK);
}

/**
 * ADC1
 */

void ADC1_init(void) {
    int tErrorCode;

    ADC1Handle.Instance = ADC1;
// must be done before HAL_ADC_Init()
    ADC1Handle.DMA_Handle = &DMA11_ADC1_Handle;

    ADC1Handle.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    ADC1Handle.Init.ScanConvMode = DISABLE;
    ADC1Handle.Init.ContinuousConvMode = DISABLE; // one conversion after trigger
    ADC1Handle.Init.NbrOfConversion = 1;
    ADC1Handle.Init.DiscontinuousConvMode = DISABLE;
    ADC1Handle.Init.NbrOfDiscConversion = 1;
#ifdef STM32F30X
    ADC1Handle.Init.ClockPrescaler = ADC_CLOCK_ASYNC; // uses ADC_12CK Clock source
    ADC1Handle.Init.Resolution = ADC_RESOLUTION12b;
    ADC1Handle.Init.EOCSelection = EOC_SINGLE_CONV;
    ADC1Handle.Init.LowPowerAutoWait = DISABLE;
    ADC1Handle.Init.ExternalTrigConv = ADC_EXTERNALTRIGCONV_T6_TRGO; //TIM6_TRGO event
    ADC1Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
    ADC1Handle.Init.DMAContinuousRequests = DISABLE;
    ADC1Handle.Init.Overrun = OVR_DATA_OVERWRITTEN;
#endif
    /*
     * this call starts also the voltage regulator, waits for stabilizing and calls HAL_ADC_MspInit()
     */
    tErrorCode = HAL_ADC_Init(&ADC1Handle);

    /*
     * calibration
     */
#ifdef STM32F30X
    tErrorCode |= HAL_ADCEx_Calibration_Start(&ADC1Handle, ADC_SINGLE_ENDED);
#else
    tErrorCode |= HAL_ADCEx_Calibration_Start(&ADC1Handle);
#endif
    assert_param(tErrorCode == HAL_OK);

