ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
    /*
     * Multi mode disabled
     */
//    ADC_MultiModeTypeDef tADC_MultiModeInitStructure;
//    tADC_MultiModeInitStructure.Mode = ADC_MODE_INDEPENDENT;
#ifdef STM32F30X
//    tADC_MultiModeInitStructure.DMAAccessMode = ADC_DMAACCESSMODE_DISABLED; // multiple DMA mode disabled
//    tADC_MultiModeInitStructure.TwoSamplingDelay = 0;
#endif
//    HAL_ADCEx_MultiModeConfigChannel(&ADC1Handle, &tADC_MultiModeInitStructure);

//
    isADCInitializedForTimerEvents = true;

    /* Enable ADC DMA mode */
#ifdef STM32F30X
    SET_BIT(ADC1Handle.Instance->CFGR, ADC_CFGR_DMAEN);
#else
    SET_BIT(ADC1Handle.Instance->CR2, ADC_CR2_DMA);
#endif

    /* Enable ADC */
    ADC_enableAndWait(&ADC1Handle);

    // set actual multiplier etc. by reading the ref voltage
    ADC_setRawToVoltFactor();

    DSO_initializeAttenuatorAndAC();
    ADC_initalizeTimer();
}

void ADC_enableAndWait(ADC_HandleTypeDef* aADCHandle) {
    __HAL_ADC_ENABLE(aADCHandle);
#ifdef STM32F30X
    // wait for ADRDY
    setTimeoutMillis(50);
    while (__HAL_ADC_GET_FLAG(aADCHandle, ADC_FLAG_RDY) == RESET) {
        __HAL_ADC_ENABLE(aADCHandle); // The statement above is not sufficient :-(
        if (isTimeout(aADCHandle->Instance->CR)) {
            break;
        }
    }
#else
// wait for 0-1 usec (not really needed yet)
#endif
}

void ADC_disableAndWait(ADC_HandleTypeDef* aADCHandle) {
#ifdef STM32F30X
// stop if not already done
    if (HAL_IS_BIT_SET(aADCHandle->Instance->CR, ADC_CR_ADSTART)) {
        SET_BIT(aADCHandle->Instance->CR, ADC_CR_ADSTP);
    }
// wait for stop to complete
    setTimeoutMillis(20);
    while (HAL_IS_BIT_SET(aADCHandle->Instance->CR, ADC_CR_ADSTP)) {
        if (isTimeout(aADCHandle->Instance->CR)) {
            break;
        }
    }
// then disable ADC otherwise sometimes interrupts just stops after the first reading
    __HAL_ADC_DISABLE(aADCHandle);
// wait for disable to complete
    setTimeoutMillis(10);
    while (HAL_IS_BIT_SET(aADCHandle->Instance->CR, ADC_CR_ADDIS)) {
        if (isTimeout(aADCHandle->Instance->CR)) {
            break;
        }
    }
#else
    __HAL_ADC_DISABLE(aADCHandle);
#endif
}

/**
 * ADC must be ready and continuous mode disabled
 * @param aChannel
 * @param aOversamplingExponent 0 -> 2^0 = 1 sample, 1 -> 2^1 = 2 samples etc.
 * @return 2 * ADC_MAX_CONVERSION_VALUE on timeout
 */
uint16_t ADC1_getChannelValue(uint8_t aChannel, int aOversamplingExponent) {

    if (isADCInitializedForTimerEvents) {
#ifdef STM32F30X
        MODIFY_REG(ADC1Handle.Instance->CFGR, ADC_CFGR_EXTSEL|ADC_CFGR_EXTEN, ADC_SOFTWARE_START | ADC_EXTERNALTRIGCONVEDGE_NONE);
#else
        MODIFY_REG(ADC1Handle.Instance->CR2, ADC_CR2_EXTSEL, ADC_SOFTWARE_START);
#endif
    }
// use conservative sample time (ADC Clocks!)
// temperature needs 2.2 micro seconds
    ADCChannelConfigDefault.Channel = aChannel;
    ADCChannelConfigDefault.SamplingTime = ADC_SAMPLETIME_SENSOR;
    HAL_ADC_ConfigChannel(&ADC1Handle, &ADCChannelConfigDefault);

// use slow clock
#ifdef STM32F30X
    __HAL_RCC_ADC12_CONFIG(RCC_ADC12PLLCLK_DIV64); // 1,125 MHz
#else
            __HAL_RCC_ADC_CONFIG(RCC_ADCPCLK2_DIV8); // 9 MHz
#endif
    uint16_t tValue = 0;
    bool tTimeout = false;
    for (int i = 0; i < (1 << aOversamplingExponent); ++i) {
#ifdef STM32F30X
        SET_BIT(ADC1Handle.Instance->CR, ADC_CR_ADSTART);
#else
        // could use external software trigger and (ADC_CR2_SWSTART | ADC_CR2_EXTTRIG) instead
        SET_BIT(ADC1Handle.Instance->CR2, ADC_CR2_ADON);
#endif        /* Test EOC flag */
        setTimeoutMillis(ADC_DEFAULT_TIMEOUT);
        while (__HAL_ADC_GET_FLAG(&ADC1Handle, ADC_FLAG_EOC) == RESET) {
#ifdef STM32F30X
            if (isTimeout(ADC1Handle.Instance->ISR)) {
#else
                if (isTimeout(ADC1Handle.Instance->SR)) {
#endif
                tTimeout = true;
                break;
            }
        }
        tValue += HAL_ADC_GetValue(&ADC1Handle);
    }
    if (tTimeout) {
        return 2 * ADC_MAX_CONVERSION_VALUE;
    }
    tValue = tValue >> aOversamplingExponent;

//    // restore ADC configuration for timer events
    if (isADCInitializedForTimerEvents) {
#ifdef STM32F30X
        MODIFY_REG(ADC1Handle.Instance->CFGR, ADC_CFGR_EXTSEL|ADC_CFGR_EXTEN,
                ADC1_EXTERNALTRIGCONV |ADC_EXTERNALTRIGCONVEDGE_RISING);
#else
        MODIFY_REG(ADC1Handle.Instance->CR2, ADC_CR2_EXTSEL, ADC1_EXTERNALTRIGCONV);
#endif
    }
    return tValue;
}

void ADC_SelectChannelAndSetSampleTime(ADC_HandleTypeDef* aADCHandle, uint8_t aChannelNumber, bool aFastMode) {
    ADCChannelConfigDefault.Channel = aChannelNumber;
    uint32_t tSampleTime = 0;
    switch (aChannelNumber) {
    case ADC_CHANNEL_1: // fast channels
    case ADC_CHANNEL_2: // fast channels
    case ADC_CHANNEL_3:
#ifdef STM32F30X
        tSampleTime = ADC_SAMPLETIME_4CYCLES_5;
#else
        case ADC_CHANNEL_0: // fast channels
        tSampleTime = ADC_SAMPLETIME_7CYCLES_5;
#endif
        break;
    case ADC_CHANNEL_7: //slow channel
        break;
    case ADC_CHANNEL_TEMPSENSOR:
    case ADC_CHANNEL_VREFINT:
#ifdef STM32F30X
    case ADC_CHANNEL_VBAT:
#endif
        tSampleTime = ADC_SAMPLETIME_SENSOR;
// TEMP + VBAT channel need 2.2 micro sec. sampling
// VREFINT needs 5.1 micro sec on F103
//        tSampleTime = ADC_SAMPLETIME_61CYCLES_5;
// already set at ADC_init => just return
        break;
    default:
        break;
    }
    if (aFastMode || tSampleTime == 0) {
        tSampleTime = ADC_SAMPLETIME_1CYCLE_5;
    }
    ADCChannelConfigDefault.SamplingTime = tSampleTime;
    HAL_ADC_ConfigChannel(aADCHandle, &ADCChannelConfigDefault);
}

#ifdef STM32F30X
/**
 * from 0x00 to 0x0B which results in prescaler from 1 to 256
 */
void ADC12_SetClockPrescaler(uint32_t aValue) {
    aValue &= 0x0F;
    if (aValue > 0x0B) {
        aValue = 0x0B;
    }
    aValue = (aValue << 4) + RCC_ADC12PLLCLK_DIV1;
//RCC_ADCCLKConfig(aValue);
    CLEAR_BIT(RCC->CFGR2, RCC_CFGR2_ADCPRE12);
    /* Set ADCPRE bits according to RCC_PLLCLK value */
    SET_BIT(RCC->CFGR2, aValue);
}
#endif

#define STM32F3D_ADC_TIMER_PRESCALER_START (9 - 1)

void ADC_initalizeTimer(void) {
    TIM_DSOHandle.Instance = ADC_DSO_TIMER;

    /* TIM3 TIM6 clock enable */
    ADC_DSO_TIMER_CLK_ENABLE()
    ;

    /* Time base configuration */
    TIM_DSOHandle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    TIM_DSOHandle.Init.Prescaler = STM32F3D_ADC_TIMER_PRESCALER_START; // 1/8 us resolution (72/9)
    TIM_DSOHandle.Init.Period = 25 - 1; // 10 us
    TIM_DSOHandle.Init.CounterMode = TIM_COUNTERMODE_UP;
    TIM_DSOHandle.Init.RepetitionCounter = 0x00;
    HAL_TIM_Base_Init(&TIM_DSOHandle);

    TIM_MasterConfigTypeDef tMasterConfig;
    tMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE; // trigger on each update
    tMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    HAL_TIMEx_MasterConfigSynchronization(&TIM_DSOHandle, &tMasterConfig);
//    TIM_SelectOutputTrigger(STM32F3D_ADC_TIMER, TIM_TRGOSource_Update);

// enable Interrupt for testing purposes
//  ADC_Timer6EnableInterrupt();
}

/**
 * not used yet
 */
//void ADC_Timer6EnableInterrupt(void) {
//// lowest possible priority
//    NVIC_SetPriority((IRQn_Type) (TIM6_DAC_IRQn), 15);
//    HAL_NVIC_EnableIRQ((IRQn_Type) (TIM6_DAC_IRQn));
//    __HAL_TIM_ENABLE_IT(&TIM_DSOHandle, TIM_IT_UPDATE);
//}
void ADC_SetTimerPeriod(uint16_t aDivider, uint16_t aPrescalerDivider) {
    TIM_DSOHandle.Instance->PSC = aPrescalerDivider - 1;
    __HAL_TIM_SetAutoreload(&TIM_DSOHandle, aDivider - 1)
    ;
    HAL_TIM_GenerateEvent(&TIM_DSOHandle, TIM_EventSource_Update);
// TIM_PrescalerConfig(STM32F3D_ADC_TIMER, aPrescalerDivider - 1, TIM_PSCReloadMode_Immediate);
}

