ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
/*
 * ADC DMA
 */
void ADC1_DMA_initialize(void) {
    __DMA1_CLK_ENABLE()
    ;

    DMA_HandleTypeDef * tDMA_ADCHandle = ADC1Handle.DMA_Handle;

    tDMA_ADCHandle->Instance = DMA1_Channel1;

// DMA1 channel1 configuration
    tDMA_ADCHandle->Init.Direction = DMA_PERIPH_TO_MEMORY;
    tDMA_ADCHandle->Init.PeriphInc = DMA_PINC_DISABLE;
    tDMA_ADCHandle->Init.MemInc = DMA_MINC_ENABLE;
    tDMA_ADCHandle->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    tDMA_ADCHandle->Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    tDMA_ADCHandle->Init.Mode = DMA_NORMAL;
    tDMA_ADCHandle->Init.Priority = DMA_PRIORITY_HIGH;
    HAL_DMA_Init(tDMA_ADCHandle);

    tDMA_ADCHandle->Instance->CPAR = (uint32_t) &ADC1Handle.Instance->DR;

//  prio 13 because it takes so much CPU that touch events do not really work
    NVIC_SetPriority((IRQn_Type) (DMA1_Channel1_IRQn), 13);
    HAL_NVIC_EnableIRQ((IRQn_Type) (DMA1_Channel1_IRQn));

//TC -> transfer complete interrupt
// Enable DMA1 channel1
//  DMA_ITConfig(DSO_DMA_CHANNEL, DMA_IT_TC | DMA_IT_HT | DMA_IT_TE, ENABLE);

    __HAL_DMA_ENABLE_IT(tDMA_ADCHandle, DMA_IT_TC| DMA_IT_TE);
}

//void ADC12_initForDualMode(void) {
//    ADC_CommonInitTypeDef ADC12_InitStructure;
//    ADC12_InitStructure.ADC_Clock = ADC_Clock_SynClkModeDiv1;
//    ADC12_InitStructure.ADC_DMAMode = ADC_DMAMode_OneShot;
//    ADC12_InitStructure.ADC_DMAAccessMode = ADC_DMAAccessMode_1; // MDMA Mode for 12 bit
//    ADC12_InitStructure.ADC_Mode = ADC_Mode_Independent; //still in independent mode
//    ADC12_InitStructure.ADC_TwoSamplingDelay = 4; // Delay 5 clocks ( + 2 for sample)
//    ADC_CommonInit(ADC1, &ADC12_InitStructure);
//}
//
//void ADC12_DMA1_setDualMode(void) {
//// DMA 32 bit PeripheralDataSize
//    DMA11_ADC1_Handle.Instance->CCR &= ~DMA_CCR_PSIZE;
//    DMA11_ADC1_Handle.Instance->CCR |= DMA_PeripheralDataSize_Word;
//// Use common data register of ADC1+2
//    DMA11_ADC1_Handle.Instance->CPAR = (uint32_t) &(ADC1_2->CDR);
//    ADC1_2->CCR &= ~ADC12_CCR_MULTI;
//    ADC1_2->CCR |= ADC_Mode_Interleave;
//}
//
//void ADC12_DMA1_setSingleADC1Mode(void) {
//// DMA 32 bit PeripheralDataSize
//    DMA11_ADC1_Handle.Instance->CCR &= ~DMA_CCR_PSIZE;
//    DMA11_ADC1_Handle.Instance->CCR |= DMA_PeripheralDataSize_HalfWord;
//    DMA11_ADC1_Handle.Instance->CPAR = (uint32_t) &(ADC1->DR);
//    ADC1_2->CCR &= ~ADC12_CCR_MULTI;
//    ADC1_2->CCR |= ADC_Mode_Interleave;
//}

void ADC1_DMA_start(uint32_t aMemoryBaseAddr, uint16_t aBufferSize, bool aModeCircular) {
// Disable DMA1 channel1 - is really needed here!
    DMA_HandleTypeDef * tDMA_ADCHandle = ADC1Handle.DMA_Handle;
    CLEAR_BIT(tDMA_ADCHandle->Instance->CCR, DMA_CCR_EN);

#ifdef STM32F30X
    if (aModeCircular) {
// ADC_DMAConfig(ADC1, ADC_DMAMode_Circular );
        SET_BIT(ADC1Handle.Instance->CFGR, ADC_CFGR_DMACFG);
        SET_BIT(ADC1_2_COMMON->CCR, ADC12_CCR_DMACFG); //for dual modus
        SET_BIT(tDMA_ADCHandle->Instance->CCR, DMA_CCR_CIRC);
    } else {
// ADC_DMAConfig(ADC1, ADC_DMAMode_OneShot );
        CLEAR_BIT(ADC1Handle.Instance->CFGR, ADC_CFGR_DMACFG);
        CLEAR_BIT(ADC1_2_COMMON->CCR, ADC12_CCR_DMACFG);
        CLEAR_BIT(tDMA_ADCHandle->Instance->CCR, DMA_CCR_CIRC);
    }
#else
    if (aModeCircular) {
// ADC_DMAConfig(ADC1, ADC_DMAMode_Circular );
        //SET_BIT(ADC1_2_COMMON->CCR, ADC12_CCR_DMACFG); //for dual modus
        SET_BIT(tDMA_ADCHandle->Instance->CCR, DMA_CCR_CIRC);
    } else {
// ADC_DMAConfig(ADC1, ADC_DMAMode_OneShot );
        //CLEAR_BIT(ADC1_2_COMMON->CCR, ADC12_CCR_DMACFG);
        CLEAR_BIT(tDMA_ADCHandle->Instance->CCR, DMA_CCR_CIRC);
    }
#endif

// Write to DMA Channel1 CMAR
    tDMA_ADCHandle->Instance->CMAR = aMemoryBaseAddr;
// Write to DMA1 Channel1 CNDTR
    tDMA_ADCHandle->Instance->CNDTR = aBufferSize;

//  DMA_Cmd(DSO_DMA_CHANNEL, ENABLE);
// enable channel and all interrupts too
    SET_BIT(tDMA_ADCHandle->Instance->CCR, DMA_CCR_EN | DMA_CCR_TCIE | DMA_CCR_HTIE | DMA_CCR_TEIE);

// starts conversion at next timer edge - is definitely needed to start dma transfer!
#ifdef STM32F30X
    SET_BIT(ADC1Handle.Instance->CR, ADC_CR_ADSTART);
#else
    SET_BIT(ADC1Handle.Instance->CR2, ADC_CR2_EXTTRIG);
#endif
}

/*
 * Stop DMA channel
 */
void ADC1_DMA_stop(void) {
// Disable DMA1 channel1
    CLEAR_BIT(ADC1Handle.DMA_Handle->Instance->CCR, DMA_CCR_EN);
// reset all bits
    __HAL_DMA_CLEAR_FLAG(ADC1Handle.DMA_Handle, DMA_FLAG_GL1);
//    DMA_ClearITPendingBit (DMA1_IT_GL1);
}

/*
 * read internal Temp sensor by ADC1 channel 16, compensate for VDD not 3.3V and convert it
 */
#define TEMP110_CAL_ADDR  ((uint16_t*) ((uint32_t)0x1FFFF7C2))  /* Internal temperature sensor, parameter TS_CAL1: TS ADC raw data acquired at a temperature of  30 DegC (+-5 DegC), VDDA = 3.3 V (+-10 mV) */
#define TEMP30_CAL_ADDR   ((uint16_t*) ((uint32_t)0x1FFFF7B8))  /* Internal temperature sensor, parameter TS_CAL2: TS ADC raw data acquired at a temperature of 110 DegC (+-5 DegC), VDDA = 3.3 V (+-10 mV) */

#define INTERNAL_TEMPSENSOR_V25        ((int32_t)1430)         /* Internal temperature sensor, parameter V25 (unit: mV). Refer to device datasheet for min/typ/max values. */
#define INTERNAL_TEMPSENSOR_AVGSLOPE   ((int32_t)4300)         /* Internal temperature sensor, parameter Avg_Slope (unit: uV/DegCelsius). Refer to device datasheet for min/typ/max values. */                                                               /* This calibration parameter is intended to calculate the actual VDDA from Vrefint ADC measurement. */

// Temperature = (VTS - V25)/Avg_Slope + 25
#define COMPUTATION_TEMPERATURE_STD_PARAMS(TS_ADC_DATA)                        \
  ((((int32_t)(INTERNAL_TEMPSENSOR_V25 - (((TS_ADC_DATA) * (sVDDA * 1000)) / 4095)   \
     ) * 1000000                                                                  \
    ) / INTERNAL_TEMPSENSOR_AVGSLOPE                                           \
   ) + 25000                                                                      \
  )

