ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
int ADC1_getTemperatureMilligrades(void) {
    int tADCTempShift3 = ADC1_getChannelValue(ADC_CHANNEL_TEMPSENSOR, 4);
#ifdef STM32F30X
// convert it to value at 3.3 V
    tADCTempShift3 = ((tADCTempShift3 * (*VREFINT_CAL)) << 3) / sRefintActualReading;

    int tTempValueAt30Degree = *(uint16_t*) (TEMP30_CAL_ADDR);        //0x6BE
    int tTempValueAt110Degree = *(uint16_t*) (TEMP110_CAL_ADDR);        //0x509
// 1.43V at 25C = 0x6EE  4.3mV/C => 344mV/80C
    if (sTempValueAtZeroDegreeShift3 == 0) {
// not initialized -> do it here
// tTempValueAt30Degree - (((tTempValueAt110Degree - tTempValueAt30Degree)/80)*30)
// => tTempValueAt30Degree - (((tTempValueAt110Degree - tTempValueAt30Degree)/8)*3)
        sTempValueAtZeroDegreeShift3 = (tTempValueAt30Degree << 3) - ((tTempValueAt110Degree - tTempValueAt30Degree) * 3);
    }
    return ((sTempValueAtZeroDegreeShift3 - tADCTempShift3) * 10000) / (tTempValueAt30Degree - tTempValueAt110Degree);

#else
    return COMPUTATION_TEMPERATURE_STD_PARAMS(tADCTempShift3);
#endif
}

float ADC_getTemperature(void) {
    int tMilligrades = ADC1_getTemperatureMilligrades();
    float tActualTemperature = (float) tMilligrades;
    return tActualTemperature / 1000;
}

/*
 * DSO Attenuator coding at PIN B12 + B13
 */
#ifndef USE_STM32F3_DISCO
int DSO_detectAttenuatorType(void) {
    int tAttenuatorType = !(DSO_ATTENUATOR_PORT->IDR & DSO_ATTENUATOR_DETECT_0_PIN);
    tAttenuatorType |= (!(DSO_ATTENUATOR_PORT->IDR & DSO_ATTENUATOR_DETECT_1_PIN)) << 1;
    return tAttenuatorType;
}
#endif

void DSO_initializeAttenuatorAndAC(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable the GPIO Clock */
    __GPIOC_CLK_ENABLE()
    ;

// Bit 0,1,2 pin, AC range pin
    GPIO_InitStructure.Pin =
    DSO_ATTENUATOR_0_PIN | DSO_ATTENUATOR_1_PIN | DSO_ATTENUATOR_2_PIN | DSO_AC_RANGE_PIN;
    GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStructure.Pull = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(DSO_ATTENUATOR_PORT, &GPIO_InitStructure);
// set LOW
    HAL_GPIO_WritePin(DSO_ATTENUATOR_PORT,
    DSO_ATTENUATOR_0_PIN | DSO_ATTENUATOR_1_PIN | DSO_ATTENUATOR_2_PIN | DSO_AC_RANGE_PIN, GPIO_PIN_RESET);

#ifndef USE_STM32F3_DISCO
    // Atttenuator detect pin
    GPIO_InitStructure.Pin = DSO_ATTENUATOR_DETECT_0_PIN | DSO_ATTENUATOR_DETECT_1_PIN;
    GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
    GPIO_InitStructure.Pull = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(DSO_ATTENUATOR_PORT, &GPIO_InitStructure);
#endif
}

void DSO_setAttenuator(uint8_t aValue) {
// shift to right bit position
    uint16_t tValue = aValue << 7;

    tValue = tValue & 0x380;
    MODIFY_REG(DSO_ATTENUATOR_PORT->ODR, 0x380, tValue);
//GPIO_Write(ADC1_ATTENUATOR_PORT, tPort);
}

void DSO_setACMode(bool aValue) {
    if (aValue) {
        Set_GpioPin(DSO_ATTENUATOR_PORT, DSO_AC_RANGE_PIN);
    } else {
        Reset_GpioPin(DSO_ATTENUATOR_PORT, DSO_AC_RANGE_PIN);
    }
}

bool DSO_getACMode(void) {
    return (DSO_ATTENUATOR_PORT->ODR & DSO_AC_RANGE_PIN);
// GPIO_ReadOutputDataBit(ADC1_ATTENUATOR_PORT, ADC1_AC_RANGE_PIN);
}

unsigned int AccuCapacity_ADCRead(uint8_t aProbeNumber) {
    ADCChannelConfigDefault.SamplingTime = ADC_SAMPLETIME_SENSOR;
    if (aProbeNumber == 0) {
        ADCChannelConfigDefault.Channel = ADC_CHANNEL_6;
    } else {
        ADCChannelConfigDefault.Channel = ADC_CHANNEL_7;
    }
    HAL_ADC_ConfigChannel(&ADC2Handle, &ADCChannelConfigDefault);

#ifdef STM32F30X
    SET_BIT(ADC2Handle.Instance->CR, ADC_CR_ADSTART);
#else
    SET_BIT(ADC2Handle.Instance->CR2, ADC_CR2_ADON);
#endif    /* Test EOC flag */
    setTimeoutMillis(ADC_DEFAULT_TIMEOUT);
    while (__HAL_ADC_GET_FLAG(&ADC2Handle, ADC_FLAG_EOC) == RESET) {
#ifdef STM32F30X
        if (isTimeout(ADC2Handle.Instance->ISR)) {
#else
            if (isTimeout(ADC2Handle.Instance->SR)) {
#endif
            break;
        }
    }
    return HAL_ADC_GetValue(&ADC2Handle);;
}

uint16_t SPI1_getPrescaler(void) {
    return SPI1HandlePtr->Init.BaudRatePrescaler;
}

#define SPI_TIMEOUT   0x4
/**
 * @brief  Sends a Byte through the SPI interface and return the Byte received
 *         from the SPI bus.
 * @param  Byte : Byte send.
 * @retval The received byte value
 */
//uint8_t SPI1_sendReceiveOriginal(uint8_t byte) {
//    uint32_t tLR14 = getLR14();
//
//// discard RX FIFO content
//    while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) != RESET) {
//        SPI_ReceiveData8(SPI1);
//    }
//    setTimeoutMillis(SPI_TIMEOUT);
//// Wait if transmit FIFO buffer full
//    while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET) {
//        if (isTimeout(tLR14)) {
//            return 0;
//        }
//    }
//    /* Send a Byte through the SPI peripheral */
//    SPI_SendData8(SPI1, byte);
//
//    setTimeoutMillis(SPI_TIMEOUT);
//    /* Wait to receive a Byte */
//    setTimeoutMillis(SPI_TIMEOUT);
//    while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET) {
//        if (isTimeout(tLR14)) {
//            return 0;
//        }
//    }
//    /* Return the Byte read from the SPI bus */
//    return (uint8_t) SPI_ReceiveData8(SPI1);
//}
/**
 * Version of sendReceive without function calling
 */
static uint32_t inSendReceiveFast = 0; // 0 = not in function LR14 (!=0) already in function

extern "C" uint8_t SPI1_sendReceiveFast(uint8_t byte) {
    uint32_t tLR14 = getLR14();
    if (inSendReceiveFast) {
        failParamMessage(inSendReceiveFast, "inSendReceiveFast is already in use");
    }
    inSendReceiveFast = tLR14; // set semaphore
// wait for ongoing transfer to end
    while (HAL_IS_BIT_SET(SPI1HandlePtr->Instance->SR, SPI_FLAG_BSY)) {
        ;
    }
// discard RX FIFO content
    uint32_t spixbase = (uint32_t) SPI1;
    spixbase += 0x0C;

    // to suppress unused warnings
    uint8_t dummy __attribute__((unused));

    while (HAL_IS_BIT_SET(SPI1HandlePtr->Instance->SR, SPI_FLAG_RXNE)) {
        /* fetch the Byte read from the SPI bus in order to empty RX fifo */
        dummy = *(__IO uint8_t *) spixbase;
    }

    /* Send a Byte through the SPI peripheral */
    *(__IO uint8_t *) spixbase = byte;

    /* Wait to receive a Byte */
    setTimeoutMillis(SPI_TIMEOUT);
    while (HAL_IS_BIT_CLR(SPI1HandlePtr->Instance->SR, SPI_FLAG_RXNE)) {
        if (isTimeoutVerbose((uint8_t *) __FILE__, __LINE__, tLR14, 2000)) {
            break;
        }
    }

    /* Return the Byte read from the SPI bus */
    spixbase = (uint32_t) SPI1;
    spixbase += 0x0C;
    inSendReceiveFast = 0; // reset semaphore
    return *(__IO uint8_t *) spixbase;
}

bool sRTCIsInitalized = false;
void RTC_InitLSEOn(void) {
    __PWR_CLK_ENABLE()
    ; // must be done prior to __HAL_RCC_LSE_CONFIG(RCC_LSE_ON)
#ifndef STM32F30X
    /* Enable BKP CLK enable for backup registers */
    __HAL_RCC_BKP_CLK_ENABLE()
    ;
#endif

