ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
    HAL_PWR_EnableBkUpAccess(); // enable RTC Bits of RCC
    // set LSE on - 2500ms on power up 0 millis else
    __HAL_RCC_LSE_CONFIG(RCC_LSE_ON);//LSEON is on the backup domain

    // Set instance here for use of access to backup domain.
    RTCHandle.Instance = RTC;
}

/*
 * To ensure that PWR Backup access is not disabled if LSE is not used
 */
void RTC_PWRDisableBkUpAccess() {
    if (__HAL_RCC_GET_RTC_SOURCE() == RCC_RTCCLKSOURCE_LSE) {
        HAL_PWR_DisableBkUpAccess();
    }
}

/*
 * Assume that RTC_LSEOn and no HAL_PWR_DisableBkUpAccess() is called before
 */
void RTC_initialize(void) {
    /*
     * Check if LSE crystal is attached
     */
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) != RESET) {
        /*
         * LSE is active -> use it. This can only be done once after power on.
         * The manual says: This selection cannot be modified without resetting the Backup domain.
         */
        __HAL_RCC_RTC_CONFIG(RCC_RTCCLKSOURCE_LSE);
#ifdef STM32F30X
        RTCHandle.Init.AsynchPrediv = 128 - 1; // %128 is the default value for 32kHz - gives 256 Hz clock;
        RTCHandle.Init.SynchPrediv = 256 - 1;
#endif
    } else {
        __HAL_RCC_LSE_CONFIG(RCC_LSE_OFF);
        /*
         * Use HSE/32. It is still running :-) datasheet says, do not disable Backup domain
         */
#ifdef STM32F30X
        __HAL_RCC_RTC_CONFIG(RCC_RTCCLKSOURCE_HSE_DIV32); // -> 250 usec clock

        RTCHandle.Init.AsynchPrediv = 125 - 1; // max sensible value 250 us / 125 -> 2kHz / 0.5 ms clock
        RTCHandle.Init.SynchPrediv = 2000 - 1;
#else
        // if used once we cannot switch back while power is on
        // The manual says: This selection cannot be modified without resetting the Backup domain.
        __HAL_RCC_RTC_CONFIG(RCC_RTCCLKSOURCE_HSE_DIV128);
#endif
    }
    __HAL_RCC_RTC_ENABLE();

    /* RTC prescaler configuration */
#ifdef STM32F30X
    RTCHandle.Init.HourFormat = RTC_HOURFORMAT_24;
    RTCHandle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
    RTCHandle.Init.OutPutType = RTC_OUTPUT_TYPE_PUSHPULL;
    RTCHandle.Init.OutPut = RTC_OUTPUT_DISABLE;
#else
    RTCHandle.Init.AsynchPrediv = RTC_AUTO_1_SECOND;
    RTCHandle.Init.OutPut = RTC_OUTPUTSOURCE_SECOND; // Pin C13
#endif
    HAL_RTC_Init(&RTCHandle);

    if (__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY) == RESET) {
        RTC_setTime(0, 0, 12, 6, 16, 4, 2017);
    }
    sRTCIsInitalized = true;
}

void fillTimeStructure(struct tm *aTimeStructurePtr) {
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RTCHandle, &RTC_TimeStructure, FORMAT_BIN);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RTCHandle, &RTC_DateStructure, FORMAT_BIN);
    aTimeStructurePtr->tm_year = RTC_DateStructure.Year + 100;
    aTimeStructurePtr->tm_mon = RTC_DateStructure.Month - 1;
    aTimeStructurePtr->tm_mday = RTC_DateStructure.Date;
    aTimeStructurePtr->tm_hour = RTC_TimeStructure.Hours;
    aTimeStructurePtr->tm_min = RTC_TimeStructure.Minutes;
    aTimeStructurePtr->tm_sec = RTC_TimeStructure.Seconds;
}

uint8_t RTC_getSecond(void) {
    if (!sRTCIsInitalized) {
        return 0;
    }

#ifdef STM32F30X
    uint8_t tSecond = (uint8_t) (RTC->TR & (RTC_TR_ST | RTC_TR_SU));
    return tSecond;
#else
    RTC_TimeTypeDef RTC_TimeStructure;
    HAL_RTC_GetTime(&RTCHandle, &RTC_TimeStructure, FORMAT_BIN);
    return RTC_TimeStructure.Seconds;
#endif
}

#define CALIBRATION_MAGIC_NUMBER 0x5A5A5A5A
// value is set only if values are manually set by do calibration and not if default values are set
void RTC_setMagicNumber(void) {
    HAL_PWR_EnableBkUpAccess();
// Write magic number
    HAL_RTCEx_BKUPWrite(&RTCHandle, RTC_BKP_DR1, CALIBRATION_MAGIC_NUMBER);
    RTC_PWRDisableBkUpAccess();
}

/**
 *
 * @return true if magic number valid
 */
bool RTC_checkMagicNumber(void) {
    HAL_PWR_EnableBkUpAccess();
// Read magic number
    uint32_t tMagic = HAL_RTCEx_BKUPRead(&RTCHandle, RTC_BKP_DR1);
    RTC_PWRDisableBkUpAccess();
    if (tMagic == CALIBRATION_MAGIC_NUMBER) {
        return true;
    }
    return false;
}


/**
 * not used yet
 */
long RTC_getTimeAsLong(void) {
    struct tm tTm;
    fillTimeStructure(&tTm);
    return mktime(&tTm);
}

/**
 * not used yet
 * @param aStringBuffer
 * @return
 */
int RTC_getTimeStringForFile(char * aStringBuffer) {
    if (!sRTCIsInitalized) {
        //return empty string
        aStringBuffer[0] = '\0';
        return 0;
    }

    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RTCHandle, &RTC_TimeStructure, FORMAT_BIN);
    /* Display  Format : hh-mm-ss */
// do not have a buffer size :-(
    return sprintf(aStringBuffer, "%02i-%02i-%02i", RTC_TimeStructure.Hours, RTC_TimeStructure.Minutes, RTC_TimeStructure.Seconds);
}

/**
 * gets time/date string or seconds since boot if RTC not available
 * Format : yyyy-mm-dd hh-mm-ss
 * @param aStringBuffer
 * @return value of sprintf()
 */
int RTC_getDateStringForFile(char * aStringBuffer) {
    if (!sRTCIsInitalized) {
        //return empty string
        aStringBuffer[0] = '\0';
        return 0;
    }

    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RTCHandle, &RTC_TimeStructure, FORMAT_BIN);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RTCHandle, &RTC_DateStructure, FORMAT_BIN);
    if (RTC_DateStructure.Year != 0) {
        RTC_DateIsValid = true;
    } else {
// fallback - set time to seconds since boot
        uint32_t tTime = millis() / 1000;
        RTC_TimeStructure.Seconds = tTime % 60;
        tTime = tTime / 60;
        RTC_TimeStructure.Minutes = tTime % 60;
        tTime = tTime / 60;
        RTC_TimeStructure.Hours = tTime % 24;
        RTC_DateStructure.Date = (tTime / 24) + 1;
    }
    /* Display  Format : yyyy-mm-dd hh-mm-ss */
// do not have a buffer size :-(
    return sprintf(aStringBuffer, "%04i-%02i-%02i %02i-%02i-%02i", 2000 + RTC_DateStructure.Year, RTC_DateStructure.Month,
            RTC_DateStructure.Date, RTC_TimeStructure.Hours, RTC_TimeStructure.Minutes, RTC_TimeStructure.Seconds);
}

bool RTC_DateIsValid = false; // true if year != 0

/**
 * Get time/date string for display (European format)
 * Format : dd.mm.yyyy hh:mm:ss
 * sets RTC_DateIsValid to false if RTC not available
 * @param aStringBuffer
 * @return value of sprintf()
 */
int RTC_getTimeString(char * aStringBuffer) {
    if (!sRTCIsInitalized) {
        //return empty string
        aStringBuffer[0] = '\0';
        return 0;
    }

