ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RTCHandle, &RTC_TimeStructure, FORMAT_BIN);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RTCHandle, &RTC_DateStructure, FORMAT_BIN);
    if (RTC_DateStructure.Year != 0) {
        RTC_DateIsValid = true;
    }
    /* Display  Format : dd.mm.yyyy hh:mm:ss */
// do not have a buffer size :-(
    return sprintf(aStringBuffer, "%02i.%02i.%04i %02i:%02i:%02i", RTC_DateStructure.Date, RTC_DateStructure.Month,
            2000 + RTC_DateStructure.Year, RTC_TimeStructure.Hours, RTC_TimeStructure.Minutes, RTC_TimeStructure.Seconds);
}

void RTC_setTime(uint8_t sec, uint8_t min, uint8_t hour, uint8_t dayOfWeek, uint8_t day, uint8_t month, uint16_t year) {
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    RTC_DateStructure.Year = year - 2000;
    RTC_DateStructure.Month = month;
    RTC_DateStructure.Date = day;
    RTC_DateStructure.WeekDay = dayOfWeek;
    HAL_RTC_SetDate(&RTCHandle, &RTC_DateStructure, FORMAT_BIN);

    RTC_TimeStructure.Hours = hour;
    RTC_TimeStructure.Minutes = min;
    RTC_TimeStructure.Seconds = sec;
#ifdef STM32F30X
    RTC_TimeStructure.TimeFormat = RTC_HOURFORMAT12_AM;
    RTC_TimeStructure.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
    RTC_TimeStructure.StoreOperation = RTC_STOREOPERATION_RESET;
#endif
    HAL_RTC_SetTime(&RTCHandle, &RTC_TimeStructure, FORMAT_BIN);
}

#ifdef HAL_WWDG_MODULE_ENABLED
/*
 * WWDG Window Watchdog
 */
static int WWDG_ExtendedCounter;
#define WWDG_EXTENDED_COUNTER_RELOAD_VALUE 100 // -> 6 sec
void Watchdog_init(void) {
    __WWDG_CLK_ENABLE()
    ;
// Disable WWDG on debug
    __HAL_FREEZE_WWDG_DBGMCU();
// set high priority
    NVIC_SetPriority((IRQn_Type) (WWDG_IRQn), 4);
    HAL_NVIC_EnableIRQ((IRQn_Type) (WWDG_IRQn));

    WWDGHandle.Instance = WWDG;
    WWDGHandle.Init.Prescaler = WWDG_PRESCALER_8; // highest prescaler -> lowest clock
    WWDGHandle.Init.Window = 0x7F; // no window
    WWDGHandle.Init.Counter = 0x7F; // appr. 57ms
    HAL_WWDG_Init(&WWDGHandle);
    WWDG_ExtendedCounter = WWDG_EXTENDED_COUNTER_RELOAD_VALUE;
}

void Watchdog_start(void) {
// Start it with interrupt enabled
    //HAL_WWDG_Start_IT();
    /* Enable the Early Wakeup Interrupt */
    __HAL_WWDG_ENABLE_IT(&WWDGHandle, WWDG_IT_EWI);

    /* Enable the peripheral */
    __HAL_WWDG_ENABLE(&WWDGHandle);

}

// must be reloaded after appr. 57 ms
extern "C" void Watchdog_reload(void) {
//HAL_WWDG_Refresh(&WWDGHandle, 0x7F);
    MODIFY_REG(WWDGHandle.Instance->CR, WWDG_CR_T, 0x7F);
    WWDG_ExtendedCounter = WWDG_EXTENDED_COUNTER_RELOAD_VALUE;
}

extern "C" void WWDG_IRQHandler(void) {
//HAL_WWDG_Refresh(&WWDGHandle, 0x7F);
    MODIFY_REG(WWDGHandle.Instance->CR, WWDG_CR_T, 0x7F);
    Toggle_TimeoutLEDPin();
    /* Clear the WWDG Data Ready flag */
    __HAL_WWDG_CLEAR_FLAG(&WWDGHandle, WWDG_FLAG_EWIF);
    if (WWDG_ExtendedCounter-- < 0) {
        WWDG_ExtendedCounter = WWDG_EXTENDED_COUNTER_RELOAD_VALUE * 10;
        BlueDisplay1.setWriteStringSizeAndColorAndFlag(TEXT_SIZE_11, COLOR16_RED, COLOR16_WHITE, true);
        printStackpointerAndStacktrace(9, 8);
    }
}

void reset(void) {
// generate immediate reset by writing 3F to WWDG
// can't use HAL_WWDG_Refresh() since it does not accept 0x3F
    MODIFY_REG(WWDGHandle.Instance->CR, WWDG_CR_T, 0x3F);
}
#endif

/*
 * Timer
 */
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *aTIMHandle) {
    GPIO_InitTypeDef GPIO_InitStructure;

    if (aTIMHandle == &TIMToneHandle) {
        TONE_TIMER_IO_CLK_ENABLE()
        ;
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStructure.Pull = GPIO_NOPULL; //GPIO_PuPd_DOWN;
        GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
        GPIO_InitStructure.Pin = TONE_TIMER_PIN;
#ifdef STM32F30X
        GPIO_InitStructure.Alternate = GPIO_AF2_TIM3;
#endif
        HAL_GPIO_Init(TONE_TIMER_PORT, &GPIO_InitStructure);

    } else if (aTIMHandle == &TIMSynthHandle) {
        SYNTH_TIMER_IO_CLOCK_ENABLE()
        ;
// Synthesizer output pin
        GPIO_InitStructure.Pin = SYNTH_TIMER_PIN;
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStructure.Pull = GPIO_NOPULL;
        GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
#ifdef STM32F30X
        GPIO_InitStructure.Alternate = GPIO_AF10_TIM2;
#endif
        HAL_GPIO_Init(SYNTH_TIMER_PORT, &GPIO_InitStructure);
#ifndef STM32F30X
        __HAL_AFIO_REMAP_TIM2_PARTIAL_1();
#endif
    }
}

extern "C" void TIM_OC1_SetConfig(TIM_TypeDef *TIMx, TIM_OC_InitTypeDef *OC_Config);

/**
 * PWM for tone generation for Pin C6 with timer 3
 */
#define TONE_TIMER_TICK_FREQ 1000000
void initalizeTone(void) {
    TIMToneHandle.Instance = TONE_TIMER;

    /* clock enable */
    TONE_TIMER_CLK_ENABLE()
    ;
    uint16_t PrescalerValue = (uint16_t) ((SystemCoreClock / 2) / (TONE_TIMER_TICK_FREQ)) - 1; // 1 MHZ Timer Frequency

    /* Time base configuration */
    TIMToneHandle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    TIMToneHandle.Init.Period = 1000; // 1 kHz initial
    TIMToneHandle.Init.Prescaler = PrescalerValue;
    TIMToneHandle.Init.CounterMode = TIM_COUNTERMODE_UP;
    HAL_TIM_Base_Init(&TIMToneHandle);

// Channel 1
    TIM_OC_InitTypeDef TIM_OCInitStructure;
    /* PWM1 Mode configuration */
    TIM_OCInitStructure.OCMode = TIM_OCMODE_PWM1;
    TIM_OCInitStructure.OCFastMode = TIM_OCFAST_DISABLE;
    TIM_OCInitStructure.Pulse = 500; // start with 50 % duty cycle
    TIM_OCInitStructure.OCPolarity = TIM_OCPOLARITY_HIGH;
    TIM_OCInitStructure.OCIdleState = TIM_OCIDLESTATE_RESET;
    TIM_OCInitStructure.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    TIM_OCInitStructure.OCNIdleState = TIM_OCNIDLESTATE_RESET;

    HAL_TIM_PWM_ConfigChannel(&TIMToneHandle, &TIM_OCInitStructure, TIM_CHANNEL_1);
// substitution here by 3 lines and one line at Synth_Timer_initialize saves 1464 bytes code
    /* Configure the Channel 1 in PWM mode */
//    TIM_OC1_SetConfig(TIMToneHandle.Instance, &TIM_OCInitStructure);
    /* Set the Preload enable bit for channel1 */
//    SET_BIT(TIMToneHandle.Instance->CCMR1, TIM_CCMR1_OC1PE);
    /* Configure the Output Fast mode */
//    CLEAR_BIT(TIMToneHandle.Instance->CCMR1, TIM_CCMR1_OC1FE);
    __HAL_TIM_ENABLE(&TIMToneHandle);
}

int32_t ToneDuration = 0; //! signed because >0 means wait, == 0 means action and < 0 means do nothing

