ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
void tone(uint16_t aFreqHertz, uint16_t aDurationMillis) {
// compute reload value
    uint32_t tPeriod = TONE_TIMER_TICK_FREQ / aFreqHertz;
    if (tPeriod >= 0x10000) {
        tPeriod = 0x10000 - 1;
    }
    __HAL_TIM_SetAutoreload(&TIMToneHandle, tPeriod - 1)
    ;
    __HAL_TIM_SetCompare(&TIMToneHandle, TIM_CHANNEL_1, tPeriod / 2); // 50 % duty cycle
    HAL_TIM_OC_Start(&TIMToneHandle, TIM_CHANNEL_1);

    ToneDuration = aDurationMillis;
    changeDelayCallback(&noTone, aDurationMillis);
}

void noTone(void) {
// disable timer PWM output
    HAL_TIM_OC_Stop(&TIMToneHandle, TIM_CHANNEL_1);
}

void FeedbackToneOK(void) {
    tone(3000, 50);
}

void playEndTone(void) {
    tone(NOTE_A5, 1000);
    delay(1000);
    tone(NOTE_E5, 1000);
    delay(1000);
    tone(NOTE_A4, 1000);
}

#define MICROSD_CS_PIN                         GPIO_PIN_5
#define MICROSD_CS_PORT                   GPIOC

#define MICROSD_CARD_DETECT_PIN                GPIO_PIN_4
#define MICROSD_CARD_DETECT_PORT          GPIOC
#define MICROSD_CARD_DETECT_EXTI_IRQn          EXTI4_IRQn

/**
 * Init the MicroSD card pins CS + CardDetect
 */
void MICROSD_IO_initalize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

// Enable the GPIO Clock
    __GPIOC_CLK_ENABLE()
    ;

// CS pin
    GPIO_InitStructure.Pin = MICROSD_CS_PIN;
    GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStructure.Pull = GPIO_NOPULL;
    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(MICROSD_CS_PORT, &GPIO_InitStructure);
// set High
    HAL_GPIO_WritePin(MICROSD_CS_PORT, MICROSD_CS_PIN, GPIO_PIN_SET);

// CardDetect pin
    GPIO_InitStructure.Pin = MICROSD_CARD_DETECT_PIN;
    GPIO_InitStructure.Mode = GPIO_MODE_IT_RISING_FALLING;
    GPIO_InitStructure.Pull = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(MICROSD_CARD_DETECT_PORT, &GPIO_InitStructure);

    /* Enable and set MicoSD EXTI Interrupt to the lowest priority */
    NVIC_SetPriority((IRQn_Type) (MICROSD_CARD_DETECT_EXTI_IRQn), 15);
    HAL_NVIC_EnableIRQ((IRQn_Type) (MICROSD_CARD_DETECT_EXTI_IRQn));
}

#ifdef HAL_DAC_MODULE_ENABLED

#define DAC_OUTPUT_PIN                       GPIO_PIN_4
#define DAC_OUTPUT_PORT                 GPIOA

/**
 * @brief  DAC channels configurations PA4 in analog,
 */
void HAL_DAC_MspInit(DAC_HandleTypeDef* aDACHandle) {
    GPIO_InitTypeDef GPIO_InitStructure;
    /* GPIOA clock enable */
    __GPIOA_CLK_ENABLE()
    ;

    /* Configure PA.04 (DAC_OUT1) as analog in to avoid parasitic consumption */
    GPIO_InitStructure.Pin = DAC_OUTPUT_PIN;
    GPIO_InitStructure.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStructure.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(DAC_OUTPUT_PORT, &GPIO_InitStructure);

    TIM7Handle.Instance = TIM7;

    /* TIM7 Peripheral clock enable */
    __TIM7_CLK_ENABLE()
    ;

    /* Time base configuration */
    TIM7Handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    TIM7Handle.Init.Prescaler = 0x0; // no prescaler
    TIM7Handle.Init.CounterMode = TIM_COUNTERMODE_DOWN; // to easily change reload value
    TIM7Handle.Init.Period = 1000; //1000=>10 Hz
    HAL_TIM_Base_Init(&TIM7Handle);

    TIM_MasterConfigTypeDef tMasterConfig;
    tMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE; // trigger on each update
    tMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    HAL_TIMEx_MasterConfigSynchronization(&TIM7Handle, &tMasterConfig);

    /* TIM7 enable counter */
    HAL_TIM_Base_Start(&TIM7Handle);
}

void DAC_init(void) {
    DAC1Handle.Instance = DAC;
    /* DAC Periph clock enable */
    __DAC1_CLK_ENABLE()
    ;

    HAL_DAC_Init(&DAC1Handle);

    static DAC_ChannelConfTypeDef tDACChannelConfig;
    /* Configuration of DAC channel 1 */
    tDACChannelConfig.DAC_Trigger = DAC_TRIGGER_T7_TRGO;
    tDACChannelConfig.DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
    HAL_DAC_ConfigChannel(&DAC1Handle, &tDACChannelConfig, DAC1_CHANNEL_1);

// set triangle Mode
    HAL_DACEx_TriangleWaveGenerate(&DAC1Handle, DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_4095);
    HAL_DAC_Start(&DAC1Handle, DAC1_CHANNEL_1);
    HAL_DAC_SetValue(&DAC1Handle, DAC1_CHANNEL_1, DAC_ALIGN_12B_R, 0x0);
}

/**
 *
 * @param aReloadValue value less than 4 makes no sense since reload operation takes 3 ticks
 */
void DAC_Timer_SetReloadValue(uint32_t aReloadValue) {
    if (aReloadValue < DAC_TIMER_MIN_RELOAD_VALUE) {
        failParamMessage(aReloadValue, "DAC reload value < 4");
    }
    uint32_t tReloadValue = aReloadValue;
    uint16_t tPrescalerValue = 1;
// convert 32 bit to 16 bit prescaler and 16 bit counter
    if (tReloadValue > 0xFFFF) {
//Count Leading Zeros
        int tShiftCount = 16 - __CLZ(aReloadValue);
        tPrescalerValue <<= tShiftCount;
        tReloadValue = aReloadValue >> tShiftCount;
    }
// BUG in Library (space) __HAL_TIM_PRESCALER(&TIM7Handle, tPrescalerValue - 1);
    TIM7Handle.Instance->PSC = tPrescalerValue - 1;
    __HAL_TIM_SetAutoreload(&TIM7Handle, tReloadValue - 1)
    ;
}

/**
 * Enable DAC Channel1: Once the DAC channel1 is enabled, Pin A.05 is automatically connected to the DAC converter.
 */
void DAC_Start(void) {
    __HAL_DAC_ENABLE(&DAC1Handle, DAC_CHANNEL_1);
    __HAL_TIM_ENABLE(&TIM7Handle);
}

void DAC_Stop(void) {
    __HAL_TIM_DISABLE(&TIM7Handle);
    __HAL_DAC_DISABLE(&DAC1Handle, DAC_CHANNEL_1);

}

/* Noise Wave generator */
void DAC_ModeNoise(void) {
    HAL_DACEx_NoiseWaveGenerate(&DAC1Handle, DAC_CHANNEL_1, DAC_LFSRUNMASK_BITS11_0);
}

/* Triangle Wave generator */
void DAC_ModeTriangle(void) {
    HAL_DACEx_TriangleWaveGenerate(&DAC1Handle, DAC_CHANNEL_1, DAC_TRIANGLEAMPLITUDE_2047);
}

// amplitude from 0 to 0x0B
void DAC_TriangleAmplitude(unsigned int aAmplitude) {
    aAmplitude &= 0x0F;
    if (aAmplitude > 0x0B) {
        aAmplitude = 0x0B;
    }
    MODIFY_REG(DAC->CR, 0xF00, aAmplitude << 8);
}
#endif

