ArminJo/STMF3-Discovery-Demos/lib/src/stm32fx0xPeripherals.cpp
#ifdef STM32F30X

/*
 * Timer 15 for IR handling
 */
void IR_Timer_initialize(uint16_t aAutoreload) {
    TIM15Handle.Instance = TIM15;
    __TIM15_CLK_ENABLE()
    ;

    TIM15Handle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    TIM15Handle.Init.Prescaler = 0x0; // no prescaler
    TIM15Handle.Init.CounterMode = TIM_COUNTERMODE_UP; // to easily change reload value
    TIM15Handle.Init.Period = aAutoreload;
    HAL_TIM_Base_Init(&TIM15Handle);

// high priority - in order to interrupt slider handling of systic interrupt
    NVIC_SetPriority((IRQn_Type) (TIM1_BRK_TIM15_IRQn), 7);
    HAL_NVIC_EnableIRQ((IRQn_Type) (TIM1_BRK_TIM15_IRQn));
    __HAL_TIM_ENABLE_IT(&TIM15Handle, TIM_IT_UPDATE);
}

void IR_Timer_Start(void) {
    __HAL_TIM_ENABLE(&TIM15Handle);
}

void IR_Timer_Stop(void) {
    __HAL_TIM_DISABLE(&TIM15Handle);
}
#endif

/* TIM2 configuration for frequency synthesizer */
void Synth_Timer_initialize(uint32_t aAutoreload) {

    TIMSynthHandle.Instance = SYNTH_TIMER;

    SYNTH_TIMER_CLOCK_ENABLE()
    ;

    /* Time base configuration */
    TIMSynthHandle.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    TIMSynthHandle.Init.Prescaler = 0x0; // no prescaler
    TIMSynthHandle.Init.Period = aAutoreload;
    TIMSynthHandle.Init.CounterMode = TIM_COUNTERMODE_DOWN; // to easily change reload value
    HAL_TIM_Base_Init(&TIMSynthHandle);

// Channel
    TIM_OC_InitTypeDef TIM_OCInitStructure;
    TIM_OCInitStructure.OCMode = TIM_OCMODE_TOGGLE; // Toggle Mode configuration
    TIM_OCInitStructure.Pulse = 0;
    TIM_OCInitStructure.OCPolarity = TIM_OCPOLARITY_HIGH;
    TIM_OCInitStructure.OCIdleState = TIM_OCIDLESTATE_RESET;
    TIM_OCInitStructure.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    TIM_OCInitStructure.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    TIM_OCInitStructure.OCFastMode = TIM_OCFAST_DISABLE;
    HAL_TIM_OC_ConfigChannel(&TIMSynthHandle, &TIM_OCInitStructure, SYNTH_TIMER_CHANNEL);
#ifdef STM32F30X
//    TIM_OC3_SetConfig(TIMSynthHandle.Instance, &TIM_OCInitStructure);
#else
    /* Configure the TIM Channel 1 in Output Compare */
//    TIM_OC1_SetConfig(TIMSynthHandle.Instance, &TIM_OCInitStructure); // saves 1464 bytes
#endif
// TODO direct counter update not wait until next change esp at 1/10 Hz
}

/**
 *
 * @param reload value
 */
void Synth_Timer32_SetReloadValue(uint32_t aReloadValue) {
// this causes the compiler to crash here
//assertParamMessage((aReloadValue > 1), aReloadValue, "HIRES reload value < 2");
    if (aReloadValue < 2) {
        failParamMessage(aReloadValue, "Synthesizer reload value < 2");
    }
    __HAL_TIM_SetAutoreload(&TIMSynthHandle, aReloadValue - 1)
    ;
}

/**
 *
 * @param reload value
 */
void Synth_Timer16_SetReloadValue(uint32_t aReloadValue, uint32_t aPrescalerValue) {
// this causes the compiler to crash here
//assertParamMessage((aReloadValue > 1), aReloadValue, "HIRES reload value < 2");
    if (aReloadValue < 2) {
        failParamMessage(aReloadValue, "Synthesizer reload value < 2");
    }

    __HAL_TIM_SetAutoreload(&TIMSynthHandle, aReloadValue - 1)
    ;
// The Macro
    TIMSynthHandle.Instance->PSC = aPrescalerValue - 1;
}

void Synth_Timer_Start(void) {
//HAL_TIMEx_OCN_Start(&TIM2Handle, TIM_CHANNEL_3);
    HAL_TIM_OC_Start(&TIMSynthHandle, SYNTH_TIMER_CHANNEL);
}

/**
 *
 * @return actual counter before stop
 */
uint32_t Synth_Timer_Stop(void) {
    uint32_t tCount = __HAL_TIM_GetCounter(&TIMSynthHandle);
    HAL_TIM_OC_Stop(&TIMSynthHandle, SYNTH_TIMER_CHANNEL);
    return tCount;
}

/**
 * Init the Debug pin E7 / B0
 */
void Misc_IO_initalize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable the GPIO Clocks */
    DEBUG_CLOCK_ENABLE()
    ;

// Debug pin
    GPIO_InitStructure.Pin = DEBUG_PIN;
    GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStructure.Pull = GPIO_NOPULL;
    GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(DEBUG_PORT, &GPIO_InitStructure);
// set Low
    HAL_GPIO_WritePin(DEBUG_PORT, DEBUG_PIN, GPIO_PIN_RESET);
#ifndef USE_STM32F3_DISCO
    TIMEOUT_LED_CLOCK_ENABLE()
    ;
    GPIO_InitStructure.Pin = TIMEOUT_LED_PIN;
    GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(TIMEOUT_LED_PORT, &GPIO_InitStructure);
    HAL_GPIO_WritePin(TIMEOUT_LED_PORT, TIMEOUT_LED_PIN, GPIO_PIN_RESET);

#endif
}

#ifdef STM32F30X

void AccuCapacity_IO_initalize(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable the GPIO Clock */
    ACCUCAP_CLOCK_ENABLE()
    ;

// Discharge 1+2 pin, Charge 1+2 pin
    GPIO_InitStructure.Pin = ACCUCAP_DISCHARGE_1_PIN | ACCUCAP_DISCHARGE_2_PIN | ACCUCAP_CHARGE_1_PIN | ACCUCAP_CHARGE_2_PIN;
    GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStructure.Pull = GPIO_PULLUP;
    GPIO_InitStructure.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(ACCUCAP_PORT, &GPIO_InitStructure);
// set LOW
    HAL_GPIO_WritePin(ACCUCAP_PORT,
    ACCUCAP_DISCHARGE_1_PIN | ACCUCAP_DISCHARGE_2_PIN | ACCUCAP_CHARGE_1_PIN | ACCUCAP_CHARGE_2_PIN, GPIO_PIN_RESET);
}

void AccuCapacity_SwitchDischarge(unsigned int aChannelIndex, bool aActive) {
    uint16_t tPinNr = ACCUCAP_DISCHARGE_2_PIN;
    if (aChannelIndex != 0) {
        tPinNr = ACCUCAP_DISCHARGE_1_PIN;
    }
    if (aActive) {
        Set_GpioPin(ACCUCAP_PORT, tPinNr);
    } else {
        Reset_GpioPin(ACCUCAP_PORT, tPinNr);
    }
}

void AccuCapacity_SwitchCharge(unsigned int aChannelIndex, bool aActive) {
    uint16_t tPinNr = ACCUCAP_CHARGE_2_PIN;
    if (aChannelIndex != 0) {
        tPinNr = ACCUCAP_CHARGE_1_PIN;
    }
    if (aActive) {
        Set_GpioPin(ACCUCAP_PORT, tPinNr);
    } else {
        Reset_GpioPin(ACCUCAP_PORT, tPinNr);
    }
}
#endif

/***************************************************************
 * EXTERN "C" functions
 ***************************************************************/
extern "C" void SPI1_setPrescaler(uint16_t aPrescaler) {
// SPI_BaudRatePrescaler_256 is also prescaler mask
    assert_param(aPrescaler == (aPrescaler & SPI_BAUDRATEPRESCALER_256) || aPrescaler == 0);
    /* Clear BR[2:0] bits (Baud Rate Control)*/
    /* Configure SPIx: Data Size */
    MODIFY_REG(SPI1->CR1, SPI_CR1_BR, aPrescaler);
    SPI1HandlePtr->Init.BaudRatePrescaler = aPrescaler;
}

/**
 * year since 1980
 * @return time since 1980 in 10 seconds resolution
 */
extern "C" uint32_t get_fattime(void) {
    RTC_DateTypeDef RTC_DateStructure;
    RTC_TimeTypeDef RTC_TimeStructure;

    /* Get the RTC current Time */
    HAL_RTC_GetTime(&RTCHandle, &RTC_TimeStructure, FORMAT_BIN);
    /* Get the RTC current Date */
    HAL_RTC_GetDate(&RTCHandle, &RTC_DateStructure, FORMAT_BIN);
// year since 1980
    uint32_t res = (((uint32_t) RTC_DateStructure.Year + 20) << 25) | ((uint32_t) RTC_DateStructure.Month << 21)

    | ((uint32_t) RTC_DateStructure.Date << 16) | (uint16_t) (RTC_TimeStructure.Hours << 11)
            | (uint16_t) (RTC_TimeStructure.Minutes << 5) | (uint16_t) (RTC_TimeStructure.Seconds >> 1);
    return res;
}

extern "C" bool MICROSD_isCardInserted(void) {
    return HAL_GPIO_ReadPin(MICROSD_CARD_DETECT_PORT, MICROSD_CARD_DETECT_PIN);
}

extern "C" void MICROSD_CSEnable(void) {
// set to LOW
    Reset_GpioPin(MICROSD_CARD_DETECT_PORT, MICROSD_CS_PIN);
}

extern "C" void MICROSD_CSDisable(void) {
// set to HIGH
    Set_GpioPin(MICROSD_CARD_DETECT_PORT, MICROSD_CS_PIN);
}

extern "C" void MICROSD_ClearITPendingBit(void) {
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_4);
}

/**
 * ISR for ADC timer 6 and for DAC1&2 underrun error interrupts
 * not used yet
 */
extern "C" void TIM6_DAC_IRQHandler(void) {
    __HAL_TIM_CLEAR_FLAG(&TIM_DSOHandle, TIM_IT_UPDATE);
}

#ifdef USE_STM32F3_DISCO
#include "stm32f3_discovery.h"
extern "C" void Default_IRQHandler(void) {
    BSP_LED_Toggle(LED_GREEN); // GREEN WEST
}
#else
extern "C" void Default_IRQHandler(void) {
}
#endif

/** @} */
